# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'
tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "mas"

# Fonts
tap "homebrew/cask-fonts"
cask "font-menlo-for-powerline"

# Magnet
mas "Magnet", id: 441258766

# Xcode
mas "Xcode", id: 497799835

### Development

brew 'git'
brew 'hub'
brew 'tree'
brew 'node'
brew 'wget'
brew 'jq'
brew 'tldr'
brew 'awscli'
brew 'atuin'

# java
brew 'java'
brew 'maven'
brew 'gradle'
cask 'intellij-idea'
brew 'jenv'

# go
brew 'go'

# python
brew 'python'
brew 'python3'
brew 'pyenv'

# ruby
brew 'rbenv'

# javascript
brew 'nvm'

# ios
cask 'simsim'
brew 'carthage'
brew 'ffmpeg' #to convert mov to mp4
brew 'fzf'
brew 'the_silver_searcher'
brew 'grc' #colourizes multiple commands

# Casks
cask 'visual-studio-code'
cask 'google-drive'
cask 'google-chrome'
cask 'vlc'
cask 'dropbox'
cask 'alfred'
cask 'evernote'
cask 'skype'
cask 'virtualbox'
cask 'spotify'
cask 'macdown'
cask 'telegram'
cask 'whatsapp'
cask 'evernote'
cask 'sourcetree'
cask 'zoom'
cask 'charles'
cask 'the-unarchiver'