# https://github.com/Homebrew/homebrew-bundle

# specify a directory to install
cask_args appdir: '/Applications'

tap "buo/cask-upgrade"
tap "ericm/stonks"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mxcl/made"

brew "ack"
brew "atuin"
brew "automake"
brew "bazelisk"
brew "brew-cask-completion"
brew "sqlite"
brew "python@3.8"
brew "carthage"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "colordiff"
brew "coreutils"
brew "cpanminus"
brew "cypher-shell"
brew "fzf"
brew "node"
brew "gatsby-cli"
brew "gh"
brew "git-crypt"
brew "git-lfs"
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "grc"
brew "hub"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "jp2a"
brew "jq"
brew "krb5"
brew "libssh2"
brew "libgit2"
brew "libusb"
brew "libnfc"
brew "mas"
brew "mergepbx"
brew "mfcuk"
brew "mfoc"
brew "mysql"
brew "needle"
brew "nvm"
brew "pcsc-lite"
brew "postgresql"
brew "pyenv"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "roundup"
brew "rust"
brew "sbt"
brew "scala"
brew "screen", link: false
brew "shadowenv"
brew "sourcery"
brew "spaceman-diff"
brew "sponge"
brew "swift-format"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "the_silver_searcher"
brew "tig"
brew "tokei"
brew "trash"
brew "tree"
brew "unrar"
brew "vapor"
brew "wget"
brew "xcodegen"
brew "xctool"
brew "yarn"
brew "yq"
brew "heroku/brew/heroku"
brew "mxcl/made/swift-sh"

# Casks
cask 'visual-studio-code'
cask 'google-drive'
cask 'google-chrome'
cask 'vlc'
cask 'dropbox'
cask 'alfred'
cask 'evernote'
cask 'skype'
cask 'virtualbox'
cask 'spotify'
cask 'macdown'
cask 'telegram'
cask 'whatsapp'
cask 'evernote'
cask 'sourcetree'
cask 'zoom'
cask 'charles'
cask 'the-unarchiver'
cask 'adium'
cask 'corretto'
cask 'corretto8'
cask 'google-cloud-sdk'
cask 'rq'

mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "Tomato One", id: 907364780
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
mas "LastPass", id: 926036361
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Twitter", id: 409789998
mas "Xcode", id: 497799835
